[
    {
        "topic": "Statistics",
        "ask": "Approximately how many percent of all websites that use cookies use non-secure cookies?",
        "choices": [
            "50%",
            "60%",
            "70%",
            "80"
        ],
        "correct": 1,
        "explain": "According to a survey carried out by Web Technology Surveys, as of November 16, 2021, 80.4% of the websites using cookies use non-secure cookies. Some popular sites using cookies include Youtube.com, Taobao.com, Amazon.com, Wikipedia.org, etc.Some methodologies for conducting survey can be further referred here: https://w3techs.com/technologies"
    },
    {
        "topic": "Statistics",
        "ask": "How many percent of Gen-Z users that use the same password for several online accounts?",
        "choices": [
            "58%",
            "68%",
            "78%",
            "88%"
        ],
        "correct": 2,
        "explain": "According to Harris Poll, 78% of those aged 16-24 admit using same passwords across multiple websites. 67% of Millennials rely on single password for several accounts. 60% of Baby Boomers have a habit of password recycling. More information could be found here: https://dataprot.net/statistics/password-statistics/"
    },
    {
        "topic": "Statistics",
        "ask": "Since Covid-19, reported cyber-crimes have increased by how many percent?",
        "choices": [
            "50%",
            "100%",
            "250%",
            "300%"
        ],
        "correct": 3,
        "explain": "According to FBI, there was a 300% increase in cybercrimes. The IC3 has received 3000-4000 cybersecurity complaints each day compared to 1000 daily before Covid-19. More information could be found here: https://thehill.com/policy/cybersecurity/493198-fbi-sees-spike-in-cyber-crime-reports-during-coronavirus-pandemic"
    },
    {
        "topic": "Statistics",
        "ask": "Since the beginning of Covid-19, increase in fraudulent mails, spam, and phishing attempts have been noticed by how many percent of employees?",
        "choices": [
            "25%",
            "35%",
            "45%",
            "55%"
        ],
        "correct": 0,
        "explain": "According to Deloitte, one-quarter of the employees have received more fraudulent mails/spam mails/phishing mails at work. More information could be found here: https://www2.deloitte.com/ch/en/pages/risk/articles/covid-19-cyber-crime-working-from-home.html"
    },
    {
        "topic": "Statistics",
        "ask": "How many percent of users have stopped using public Wi-Fi to protect their online privacy?",
        "choices": [
            "17%",
            "27%",
            "37%",
            "47%"
        ],
        "correct": 1,
        "explain": "According to Norton, 27% of users have stopped using public Wi-Fi to protect their online privacy. Some other actions taken include making some/all passwords stronger (48% of users), limiting information shared on social platforms (38% of users), enabling multi-factor authenticator (22% of users), etc. More information could be found here: https://now.symassets.com/content/dam/norton/campaign/NortonReport/2021/2021_NortonLifeLock_Cyber_Safety_Insights_Report_Global_Results.pdf"
    },
    {
        "topic": "Statistics",
        "ask": "How much average ransom is paid by mid-sized organizations?",
        "choices": [
            "$170,000",
            "$190,000",
            "$210,000",
            "$230,000"
        ],
        "correct": 1,
        "explain": "According to Sophos, the average payment for ransom is $170,404 over 282 respondents, with average of $107,694 for 100-1000 employee organizations and $225,588 for 1000-5000 employee organizations. More information could be found here: https://www.sophos.com/en-us/medialibrary/pdfs/whitepaper/sophos-state-of-ransomware-2021-wp.pdf?cmp=120469"
    },
    {
        "topic": "Statistics",
        "ask": "How many percent of online fraud is accomplished through mobile platforms?",
        "choices": [
            "30%",
            "50%",
            "70%",
            "90%"
        ],
        "correct": 2,
        "explain": "According to RSA 2019 Report, 70% of fraud transactions originates in mobile channel. RSA identified an average of 82 rogue mobile applications per day in 2018. This statistic is highly likely to have increased by now. More information could be found here: https://www.rsa.com/content/dam/en/white-paper/2019-current-state-of-cybercrime.pdf"
    },
    {
        "topic": "Linux",
        "ask": "Which BASH command will NOT change the present directory to the user's home directory?",
        "choices": [
            "cd ~",
            "cd ~ && cd / && cd -",
            "cd /home/your_username",
            "cd / && cd ~ && cd -"
        ],
        "correct": 3,
        "explain": "The command `cd / && cd ~ && cd -` doesn't change the present working directory to home. Instead in sequential order it changes directories to the root, home directory, and back to root. The `cd -` jumps back to last visited directory."
    },
    {
        "topic": "Linux",
        "ask": "Which operating system family is NOT a descendant of the 1970's Unix operating system?",
        "choices": [
            "Android",
            "Windows",
            "Linux",
            "macOS"
        ],
        "correct": 1,
        "explain": "Derived from the 1980's MS-DOS operating system Microsoft Windows was developed independently from Unix. The team at Microsoft fixed this obvious mistake with the introduction of the Windows Subsystem for Linux (WSL) imbedding all the functionality of Linux into Windows."
    },
    {
        "topic": "Linux",
        "ask": "Which of the following commands will (almost certainly) NOT destroy a Linux installation?",
        "choices": [
            "sudo rm -r /usr/bin/python",
            "sudo rm -rf /",
            "sudo rm -rf ~",
            "mv / /dev/null"
        ],
        "correct": 2,
        "explain": "First off running any of these commands is a really bad idea. `sudo rm -rf ~` however probably will not destroy your OS as `~` should *only* contain user created files, one could imagine this command could an destroy an OS if oddly configured. I can testify personally that `sudo rm -r /usr/bin/python` will destroy an Ubuntu install..."
    },
    {
        "topic": "Linux",
        "ask": "Say you try to run `./some_exe` and get a `permission denied` error, whats the best solution?",
        "choices": [
            "chmod u+x some_exe",
            "sudo ./some_exe",
            "chmod 777 some_exe",
            "rm some_exe"
        ],
        "correct": 0 ,
        "explain": "This one was slightly petty as both `chmod 777` and `chmod u+x` will give the permissions needed to execute. However it is much better practice to use `chmod u+x` as it will only permit you and no other users to execute the file. However `chmod 777` allows all users all privileges on the executable, one should not be in the practice of using this command every time permission is denied."
    },
    {
        "topic": "Linux",
        "ask": "Roughly what percentage of web-servers run on a Unix derived OS?",
        "choices": [
            "5%",
            "25%",
            "75%",
            "99%"
        ],
        "correct": 2,
        "explain": "While estimates vary it seems to be a good bet that between 70% - 80% of servers delivering webpages in 2021 are running on *nix. Windows Server largely comprises the rest of the market share; It seems that free, reliable, and open-source software is a substantial draw for enterprise clients. See https://en.wikipedia.org/wiki/Usage_share_of_operating_systems for more details."
    },
    {
        "topic": "Linux",
        "ask": "What is NOT treated a file in Linux?",
        "choices": [
            "Directories",
            "Hardware Devices",
            "Internet Connection (sockets)",
            "None of the above"
        ],
        "correct": 3,
        "explain": "The basic philosophy of Linux is to reuse good ideas as much as possible. As such the designers abstracted away all sorts things into a simple file interface which can be read from or written to."
    }
        {
        "topic": "Social Media",
        "ask": "Which of the following helps Facebook track the location data of messages?",
        "choices": [
            "Face Recognition",
            "Location Sharing",
            "Activity Log",
            "None of the above"
        ],
        "correct": 1,
        "explain": "According to Business Insider, Facebook tracks the location of all messages if the Location Sharing feature is turned on. Simply turning the feature off in Settings will prevent Facebook from tracking your messages."
    }
        {
        "topic": "Social Media",
        "ask": "Which of the following practices helps keep your social media account secure?",
        "choices": [
            "Two-factor authentication",
            "Changing password regularly",
            "Learning about privacy settings",
            "All of the above"
        ],
        "correct": 3,
        "explain": "Following multiple practices to keep your account safe is a better option. Two-factor authentication, getting knowledgeable about one's privacy settings, and changing your password regularly are 3 such practices that will help keep your account secure. "
    }
        {
        "topic": "Social Media",
        "ask": "Generally in a Social Media account, when or where can you change your privacy options/settings?",
        "choices": [
            "Anytime in your settings",
            "In the popup when you post",
            "Only when you create the account",
            "Anytime in your feed"
        ],
        "correct": 0,
        "explain": "Privacy preferences can be viewed or changed from settings, and the user can change it anytime they want."
    }
        {
        "topic": "Scenario",
        "ask": "You are playing an online game with a random person. What information is safe to share?",
        "choices": [
            "Your name",
            "Your location",
            "Other personal information",
            "None of the above"
        ],
        "correct": 3,
        "explain": "Even though this might sound obvious, but it's still important to keep in mind that one should always refrain from sharing any personal information with random individuals online. This keeps you safe and your information protected from potential threats."
    }
        {
        "topic": "Social Media",
        "ask": "Which of these Social Media platforms feature end-to-end encryption?",
        "choices": [
            "Facebook",
            "Twitter",
            "Whatsapp",
            "Instagram"
        ],
        "correct": 2,
        "explain": "Whatsapp uses end-to-end encryption to help you communicate securely as only the sender and recepient can see the messages. This way all your messages, photos, videos, voice messages, documents, and calls are secure."
    }
        {
        "topic": "Scenario",
        "ask": "You have been receiving a lot of phishing emails lately. Which one of the following can be used as a reliable approach to protect you from phishing emails?",
        "choices": [
            "Educate and Monitor",
            "Reply and ask them to stop",
            "Change email accounts regularly",
            "None of the above"
        ],
        "correct": 0,
        "explain": "Using security awareness training, one can educate and train themselves to identify potential spam and risks. Certain applications or plug-ins can also be used to keep track of phishing emails and monitor threats."
    }
        {
        "topic": "Scenario",
        "ask": "You received an email with an attachment asking you to open it urgently and fill a mandatory government survey. You click on it and immediately realise it's a phishing email. What should you do?",
        "choices": [
            "Restart your device",
            "Change account passwords",
            "Report the phishing attack",
            "b & c"
        ],
        "correct": 3,
        "explain": "Changing your account passwords is a sensible choice. This becomes even more important when the user has the same password for multiple accounts. Phishing attacks can often take place on a large scale. This can happen in companies, organizations, and even neighbourhoods. Reporting such cases to authorities can help to see trends and protect others from similar attacks."
    }
]
